Contribute.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-12-12 Wed 20:10 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Grant Rettke" />
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org3324718">1. Contribute</a></li>
<li><a href="#orga470725">2. xml-rpc</a></li>
<li><a href="#org5845075">3. metaweblog</a></li>
<li><a href="#orgd9b0323">4. Org2blog</a></li>
<li><a href="#orgb63a410">5. Pretty Mode</a></li>
<li><a href="#org7a7c2e5">6. go-hydra</a></li>
<li><a href="#org04b172c">7. universal-emotions-emoticons</a></li>
<li><a href="#orgab5bf36">8. corporate-bs-generator</a></li>
</ul>
</div>
</div>
<p>
Never compile this.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf455771"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- no-byte-compile: t; -*-</span>
</pre>
</div>

<div id="outline-container-org3324718" class="outline-2">
<h2 id="org3324718"><span class="section-number-2">1</span> Contribute</h2>
<div class="outline-text-2" id="text-1">
<pre class="example">
ID: org_gcr_2017-05-12_mara:B6246A7A-5514-4478-BC3D-7768B05B08B8
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org7635a5c"><span class="org-comment-delimiter">;; </span><span class="org-comment">-*- no-byte-compile: t; -*-</span>
</pre>
</div>

<p>
Sysop is likely to use this periodically.
</p>

<p>
Start EMACS with this command:
</p>

<pre class="example">
emacs --debug-init --no-init-file --no-splash --background-color white --foreground-color black --vertical-scroll-bars --eval '(switch-to-buffer "*Messages*")' --name O2B-TEST --title O2B-TEST --load ~/src/help/.org-mode-contribute.emacs.el
</pre>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org8b4660e">(load-file <span class="org-string">"~/src/help/.org-mode-package-management.emacs.el"</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orga470725" class="outline-2">
<h2 id="orga470725"><span class="section-number-2">2</span> xml-rpc</h2>
<div class="outline-text-2" id="text-2">
<pre class="example">
ID: org_gcr_2017-12-16_mara:8490F7FD-9718-4ADD-8A84-56A8D6625C12
</pre>
<blockquote>
<p>
An elisp implementation of clientside XML-RPC
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd1c43c9">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/xml-rpc-el"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">xml-rpc</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org5845075" class="outline-2">
<h2 id="org5845075"><span class="section-number-2">3</span> metaweblog</h2>
<div class="outline-text-2" id="text-3">
<pre class="example">
ID: org_gcr_2017-12-16_mara:C3B0266C-F9EC-498B-ABBA-486090654DDA
</pre>
<blockquote>
<p>
Weblog maintenance via XML-RPC APIs
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgd9a8dfe">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/metaweblog"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">metaweblog</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd9b0323" class="outline-2">
<h2 id="orgd9b0323"><span class="section-number-2">4</span> Org2blog</h2>
<div class="outline-text-2" id="text-4">
<pre class="example">
ID: org_gcr_2018-03-03_mara:60113001-1991-4EB5-BF61-190C198AF742
</pre>
<p>
Configure Org2blog for use, development, and support.
</p>
<blockquote>
<p>
Blog from Org mode to wordpress
</p>
</blockquote>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org46e58de">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/org2blog"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">org2blog</span>)
(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org-mode-hook</span> <span class="org-highlight-quoted-quote">#'</span><span class="org-highlight-quoted-symbol">org2blog/wp-org-mode-hook-fn</span>)
</pre>
</div>

<p>
Use <a href="https://www.mathjax.org/">MathJax</a> instead of <code>wp-latex</code> syntax.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org004e4aa">(<span class="org-keyword">setq</span> org2blog/wp-use-wp-latex nil)
</pre>
</div>

<p>
Org2Blog depends on Org-Mode. This system loads Org-Mode from Git. Enter the
<code>ELPA</code> cache directory and delete it.
</p>

<p>
This system works with WisdomAndWonder. It keeps its posts separate giving focus
to each Web.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc2e005f">(<span class="org-keyword">setq</span> org2blog/wp-track-posts nil)
</pre>
</div>

<p>
Post creation handler.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org264447c">(add-hook <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">org2blog/wp-after-new-post-or-page-functions</span> (<span class="org-keyword">lambda</span> (p) (pp p)))
</pre>
</div>

<p>
Configure Org2Blog.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org5012253">(<span class="org-keyword">setq</span> org2blog/wp-blog-alist
      <span class="org-highlight-quoted-quote">'</span>((<span class="org-string">"wisdomandwonder"</span>
         <span class="org-builtin">:url</span> <span class="org-string">"https://www.wisdomandwonder.com/xmlrpc.php"</span>
         <span class="org-builtin">:username</span> <span class="org-string">"admin"</span>
         <span class="org-builtin">:default-categories</span> (<span class="org-string">"Article"</span> <span class="org-string">"Link"</span>)
         <span class="org-builtin">:confirm</span> t
         <span class="org-builtin">:show</span> <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">show</span>)))
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb63a410" class="outline-2">
<h2 id="orgb63a410"><span class="section-number-2">5</span> Pretty Mode</h2>
<div class="outline-text-2" id="text-5">
<pre class="example">
ID: org_gcr_2017-05-15_mara:CB452410-955E-4A91-A811-10755A35A142
</pre>

<p>
Visualize ASCII values as their most likely Unicode representation.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org617032b">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/pretty-mode"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">pretty-mode</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org7a7c2e5" class="outline-2">
<h2 id="org7a7c2e5"><span class="section-number-2">6</span> go-hydra</h2>
<div class="outline-text-2" id="text-6">
<pre class="example">
ID: org_gcr_2017-08-01_mara:F1CA18C6-F00E-4F1A-BBD3-77FC52B437E8
</pre>
<p>
A collection of Go related Hydras for Emacs.
</p>

<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgf2fbb73">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/go-hydra"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">go-hydra</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-org04b172c" class="outline-2">
<h2 id="org04b172c"><span class="section-number-2">7</span> universal-emotions-emoticons</h2>
<div class="outline-text-2" id="text-7">
<pre class="example">
ID: org_gcr_2017-12-05_mara:BAEA6BB3-614D-4957-BEFF-4AE9E6271BF1
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="orgc88ffc8">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/universal-emotions-emoticons"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">universal-emotions-emoticons</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgab5bf36" class="outline-2">
<h2 id="orgab5bf36"><span class="section-number-2">8</span> corporate-bs-generator</h2>
<div class="outline-text-2" id="text-8">
<pre class="example">
ID: org_gcr_2018-07-06T22-26-05-05-00_mara:EBD3FC34-3153-4E01-A8DD-099CF51A08EF
</pre>
<div class="org-src-container">
<pre class="src src-emacs-lisp" id="org75edaef">(add-to-list <span class="org-highlight-quoted-quote">'</span><span class="org-highlight-quoted-symbol">load-path</span> <span class="org-string">"~/src/corporate-bs-generator"</span>)
(<span class="org-keyword">require</span> <span class="org-highlight-quoted-quote">'</span><span class="org-constant">corporate-bs-generator</span>)
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Grant Rettke</p>
<p class="date">Created: 2018-12-12 Wed 20:10</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
